app/controllers/api_users_controller.rb

  def index
    @api_users = ApiUser.all
---
SELECT "api_users".* FROM "api_users"